Revit 2027 API
BuiltInFailures.FamilyFailures.DuplicateFamilyParameterNameWithSharedParameter Property
 Parameter '[Parameter]' has the same name with an existing shared parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuplicateFamilyParameterNameWithSharedParameter { get; }
Public Shared ReadOnly Property DuplicateFamilyParameterNameWithSharedParameter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuplicateFamilyParameterNameWithSharedParameter {
	FailureDefinitionId^ get ();
}
static member DuplicateFamilyParameterNameWithSharedParameter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace